_posts/2023-05-19-los-sinsabores-del-software-imaginario.org
* Footnotes

[fn:22] Vale aclarar que los desarrolladores de Prime Video dicen que su arquitectura inicial de lambdas les permitió experimentar rápido con el producto, por lo que no es un ejemplo del preparacionismo que describo en este artículo.

[fn:21] [[https://mcfunley.com/choose-boring-technology][Choose Boring Technology]].

[fn:13] [[https://www.radicalsimpli.city/][Radical Simplicity]].

[fn:20] En realidad dijeron ([[https://twitter.com/samnewman/status/1654432661337788416][acá]] y [[https://adrianco.medium.com/so-many-bad-takes-what-is-there-to-learn-from-the-prime-video-microservices-to-monolith-story-4bd0970423d4][acá]]) que el artículo hablaba más de los costos de usar lambdas en vez de servidores, pero preferí quedarme con el chiste comunista.

[fn:19] [[https://world.hey.com/dhh/how-to-recover-from-microservices-ce3803cc][How to recover from microservices]].

[fn:18] [[https://www.primevideotech.com/video-streaming/scaling-up-the-prime-video-audio-video-monitoring-service-and-reducing-costs-by-90][Scaling up the Prime Video audio/video monitoring service and reducing costs by 90%]].

[fn:17] [[http://www.paulgraham.com/hp.html][Hackers and Painters]].
[fn:16] [[http://www.paulgraham.com/avg.html][Beating the Averages]].

[fn:15] [[https://www.karllhughes.com/posts/plumbing][The Bulk of Software Engineering is Just Plumbing]].

[fn:12] [[https://shopify.engineering/deconstructing-monolith-designing-software-maximizes-developer-productivity][Deconstructing the Monolith: Designing Software that Maximizes Developer Productivity]].

[fn:11] [[https://twitter.com/levelsio/status/1308145873843560449][RemoteOK.io is a single PHP file]].

[fn:10] [[https://s3.amazonaws.com/systemsandpapers/papers/hamilton.pdf][On Designing and Deploying Internet Scale Services]].

[fn:9] [[https://twitter.com/alexxubyte/status/1577684758779203584?lang=es][How will you design the Stack Overflow website?]].

[fn:14] [[https://stackexchange.com/performance][Stack Exchange performance]].

[fn:8] [[https://m.signalvnoise.com/the-majestic-monolith/][The Majestic Monolith]].

[fn:7] [[https://www.oreilly.com/library/view/building-microservices-2nd/9781492034018/][Building Microservices, 2nd Edition]].

[fn:6] [[https://scholar.harvard.edu/files/waldo/files/waldo-94.pdf][A Note on Distributed Computing]].

[fn:5] [[https://en.wikipedia.org/wiki/Fallacies_of_distributed_computing][Fallacies of distributed computing]].

[fn:4] [[https://en.wikipedia.org/wiki/Brooks%27s_law][Ley de Brooks]]: "Si crece el número de personas, también crecerá el tiempo invertido en tratar de averiguar lo que hace el resto".

[fn:3] [[https://en.wikipedia.org/wiki/Conway%27s_law][Ley de Conway]]: "Las organizaciones dedicadas al diseño de sistemas están abocadas a producir diseños que son copias de las estructuras de comunicación de dichas organizaciones".

[fn:2] Me resulta parecido al de los patrones de diseño clásicos del /Gang of Four/.

[fn:1] En contraposición al software /realmente existente/, el que ya está en producción y tiene una cantidad no despreciable de usuarios a los que les provee alguna utilidad.
