_posts/2023-05-19-los-sinsabores-del-software-imaginario.md

<section class="footnotes" markdown=1>
## Notas
<!--- 
# Notas al pie de p&aacute;gina

 -->
<sup><a id="fn.1" href="#fnr.1">1</a></sup> [Scaling up the Prime Video audio/video monitoring service and reducing costs by 90%](https://www.primevideotech.com/video-streaming/scaling-up-the-prime-video-audio-video-monitoring-service-and-reducing-costs-by-90).

<sup><a id="fn.2" href="#fnr.2">2</a></sup> [How to recover from microservices](https://world.hey.com/dhh/how-to-recover-from-microservices-ce3803cc).

<sup><a id="fn.3" href="#fnr.3">3</a></sup> En realidad dijeron ([acá](https://twitter.com/samnewman/status/1654432661337788416) y [acá](https://adrianco.medium.com/so-many-bad-takes-what-is-there-to-learn-from-the-prime-video-microservices-to-monolith-story-4bd0970423d4)) que el artículo hablaba más de los costos de usar lambdas en vez de servidores, pero preferí quedarme con el chiste comunista.

<sup><a id="fn.4" href="#fnr.4">4</a></sup> Me resulta parecido al de los patrones de diseño clásicos del *Gang of Four*.

<sup><a id="fn.5" href="#fnr.5">5</a></sup> Vale aclarar que los desarrolladores de Prime Video dicen que su arquitectura inicial de lambdas les permitió experimentar rápido con el producto, por lo que no es un ejemplo del preparacionismo que describo en este artículo.

<sup><a id="fn.6" href="#fnr.6">6</a></sup> [Ley de Conway](https://en.wikipedia.org/wiki/Conway%27s_law): "Las organizaciones dedicadas al diseño de sistemas están abocadas a producir diseños que son copias de las estructuras de comunicación de dichas organizaciones".

<sup><a id="fn.7" href="#fnr.7">7</a></sup> [Ley de Brooks](https://en.wikipedia.org/wiki/Brooks%27s_law): "Si crece el número de personas, también crecerá el tiempo invertido en tratar de averiguar lo que hace el resto".

<sup><a id="fn.8" href="#fnr.8">8</a></sup> [Fallacies of distributed computing](https://en.wikipedia.org/wiki/Fallacies_of_distributed_computing).

<sup><a id="fn.9" href="#fnr.9">9</a></sup> [A Note on Distributed Computing](https://scholar.harvard.edu/files/waldo/files/waldo-94.pdf).

<sup><a id="fn.10" href="#fnr.10">10</a></sup> [Building Microservices, 2nd Edition](https://www.oreilly.com/library/view/building-microservices-2nd/9781492034018/).

<sup><a id="fn.11" href="#fnr.11">11</a></sup> En contraposición al software *realmente existente*, el que ya está en producción y tiene una cantidad no despreciable de usuarios a los que les provee alguna utilidad.

<sup><a id="fn.12" href="#fnr.12">12</a></sup> [The Majestic Monolith](https://m.signalvnoise.com/the-majestic-monolith/).

<sup><a id="fn.13" href="#fnr.13">13</a></sup> [How will you design the Stack Overflow website?](https://twitter.com/alexxubyte/status/1577684758779203584?lang=es).

<sup><a id="fn.14" href="#fnr.14">14</a></sup> [Stack Exchange performance](https://stackexchange.com/performance).

<sup><a id="fn.15" href="#fnr.15">15</a></sup> [Deconstructing the Monolith: Designing Software that Maximizes Developer Productivity](https://shopify.engineering/deconstructing-monolith-designing-software-maximizes-developer-productivity).

<sup><a id="fn.16" href="#fnr.16">16</a></sup> [RemoteOK.io is a single PHP file](https://twitter.com/levelsio/status/1308145873843560449).

<sup><a id="fn.17" href="#fnr.17">17</a></sup> [On Designing and Deploying Internet Scale Services](https://s3.amazonaws.com/systemsandpapers/papers/hamilton.pdf).

<sup><a id="fn.18" href="#fnr.18">18</a></sup> [The Bulk of Software Engineering is Just Plumbing](https://www.karllhughes.com/posts/plumbing).

<sup><a id="fn.19" href="#fnr.19">19</a></sup> [Choose Boring Technology](https://mcfunley.com/choose-boring-technology).

<sup><a id="fn.20" href="#fnr.20">20</a></sup> [Radical Simplicity](https://www.radicalsimpli.city/).

<sup><a id="fn.21" href="#fnr.21">21</a></sup> [Beating the Averages](http://www.paulgraham.com/avg.html).

<sup><a id="fn.22" href="#fnr.22">22</a></sup> [Hackers and Painters](http://www.paulgraham.com/hp.html).

</section>
